//AUTHRPT  JOB (ATLAS),'AUTH REPORT',CLASS=A,MSGCLASS=X
//STEP01   EXEC PGM=AUTHRPT
//STEPLIB  DD  DSN=ATLASPAY.LOADLIB,DISP=SHR
//SYSOUT   DD  SYSOUT=*
