//EXCRECON JOB (ATLAS),'EXCEPTION RECON',CLASS=A,MSGCLASS=X
//STEP01   EXEC PGM=EXCREC01
//STEPLIB  DD  DSN=ATLASPAY.LOADLIB,DISP=SHR
//EXCPTKS  DD  DSN=ATLASPAY.VSAM.LIMIT.EXCEPT,DISP=SHR
//SYSOUT   DD  SYSOUT=*
