//LIMITBKP JOB (ATLAS),'LIMIT BACKUP',CLASS=A,MSGCLASS=X
//COPY01   EXEC PGM=IDCAMS
//SYSPRINT DD  SYSOUT=*
//SYSIN    DD  *
  REPRO INDATASET(ATLASPAY.VSAM.LIMIT.EXCEPT) -
        OUTDATASET(ATLASPAY.BACKUP.LIMIT.EXCEPT)
/*
