       IDENTIFICATION DIVISION.
       PROGRAM-ID. LIMITPOL.

       DATA DIVISION.
       WORKING-STORAGE SECTION.
       EXEC SQL INCLUDE SQLCA END-EXEC.
       01 WS-BASE-LIMIT       PIC 9(7)V99.
       01 WS-PRODUCT-MAX      PIC 9(7)V99.
       01 WS-JURIS-LIMIT      PIC 9(7)V99.

       LINKAGE SECTION.
       COPY AUTHREQ.
       COPY LIMITCTX.

       PROCEDURE DIVISION USING AUTH-REQUEST LIMIT-CONTEXT.
           EXEC SQL
              SELECT BASE_LIMIT, PRODUCT_MAX, JURIS_LIMIT
                INTO :WS-BASE-LIMIT, :WS-PRODUCT-MAX, :WS-JURIS-LIMIT
                FROM ATLAS_LIMIT_POLICY
               WHERE PRODUCT_CODE = :AR-PRODUCT-CODE
                 AND JURISDICTION = :AR-JURISDICTION
                 AND ACTIVE_FLAG = 'Y'
           END-EXEC

           IF SQLCODE = 0
              MOVE WS-BASE-LIMIT  TO LC-BASE-LIMIT
              MOVE WS-PRODUCT-MAX TO LC-PRODUCT-MAX
              MOVE WS-JURIS-LIMIT TO LC-JURIS-LIMIT
           ELSE
              MOVE 1000.00 TO LC-BASE-LIMIT
              MOVE 1000.00 TO LC-PRODUCT-MAX
              MOVE 1000.00 TO LC-JURIS-LIMIT
           END-IF
           GOBACK.
