//DEFEXC   JOB (ATLAS),'DEFINE EXCEPT KSDS',CLASS=A,MSGCLASS=X
//STEP01   EXEC PGM=IDCAMS
//SYSPRINT DD SYSOUT=*
//SYSIN    DD *
  DEFINE CLUSTER(NAME(ATLASPAY.VSAM.LIMIT.EXCEPT) -
         INDEXED KEYS(12 0) RECORDSIZE(57 57) -
         CYLINDERS(1 1)) -
         DATA(NAME(ATLASPAY.VSAM.LIMIT.EXCEPT.DATA)) -
         INDEX(NAME(ATLASPAY.VSAM.LIMIT.EXCEPT.INDEX))
/*
