       01  AUTH-REQUEST.
           05  AR-ACCOUNT-ID          PIC X(12).
           05  AR-PRODUCT-CODE        PIC X(4).
           05  AR-JURISDICTION        PIC X(2).
           05  AR-TRANSACTION-TYPE    PIC X(2).
           05  AR-MERCHANT-CATEGORY   PIC X(4).
           05  AR-AMOUNT              PIC 9(7)V99.
           05  AR-TEMP-CONTROL-AMT    PIC 9(7)V99.
